Revit 2026 API

# FaceDetailNode Methods

---

The FaceDetailNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInstanceTransform | Returns instance transform of the object being drawn. |
|  | GetLinkTransform | Returns link transform of the object being drawn. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FaceDetailNode Class

Autodesk.Revit.DB Namespace